Задача №2. Сформировать двумерный массив размера n*m по правилу: x_ij=i^2+j^2; i=0,1,…,n-1; j=0,1,…,m-1.
Решение: 
 Для заполнения каждого элемента массива используется формула: x[i,j] = i² + j², где i — это индекс строки, а j — индекс столбца. Это означает, что для каждого элемента массива берется квадрат индекса строки и добавляется к нему квадрат индекса столбца. Например:
x[0,0] :  0² + 0² = 0 
x[0,1] :  0² + 1² = 1 
x[0,2] :  0² + 2² = 4 
x[1,0] : 1² + 0² = 1 и т.д.
После заполнения массива на экран выводится каждый его элемент. 
Программный код: 
double[,] a = new double[n, m];
for (int i = 0; i < n; i++)
{	for (int j = 0; j < m; j++)
    	{ a[i, j] = Math.Pow(i, 2) + Math.Pow(j, 2); }
}
Console.WriteLine("\nСгенерированный массив:");
for (int i = 0; i < n; i++)
{	for (int j = 0; j < m; j++)
   	{ Console.Write($"{a[i, j]} "); }
    Console.WriteLine();
}
Выполнение программы:
 
Рисунок 10 – Формирование двумерного массива по правилу: ;i=0,1,…,n-1; j=0,1,…,m-1.
Задачи для самостоятельного решения
1.	Сформировать массив m*m, где все элементы равны нулю, кроме главной диагонали, на которой стоят случайные числа от 1 до 10.
2.	Сформировать массив m*m, где на главной диагонали стоят числа от 1 до m, а все остальные элементы равны нулю.
3.	Сформировать массив m*m, где на главной диагонали стоят случайные четные числа, а выше - случайные нечетные числа.
4.	Создать массив m*m, в котором все элементы равны нулю, а по диагоналям (главной и побочной) стоят случайные числа от -5 до 5.
5.	Сформировать массив m*m, где элементы на четных строках равны их номеру строки, а на нечетных - их номеру столбца.
6.	Сформировать массив m*m, где элементы равны единице, если сумма индексов четная, и нулю, если нечетная.
7.	Сформируйте массив n x m, где элементы на четных позициях (i + j четно) равны 1, а на нечетных - 0.
8.	Дан двумерный массив. Из его отрицательных элементов сформировать новый массив.
9.	Создайте массив n x m, заполненный случайными числами, и найдите максимальный элемент массива и его индексы.
10.	Сформируйте массив m x m, где элементы на главной диагонали равны квадратам своих индексов (i^2), а остальные элементы равны нулям.
11.	Создайте массив m x m, где элементы выше главной диагонали равны 1, а ниже - случайным числам от -3 до 3.
12.	Сформируйте массив m x m, где элементы на главной и побочной диагоналях равны 1, а все остальные элементы равны -1.
13.	Создайте массив m x m, где все элементы равны нулю, кроме элементов на первой строке, которые равны их индексам (j).
14.	Сформируйте массив m x m, где элементы на главной диагонали равны случайным простым числам, а остальные - случайным составным числам от 4 до 100.
15.	Создайте массив m x m, где элементы на побочной диагонали равны 5, а остальные элементы равны произведению индексов (i * j).
